# FilterStringGreaterOrEqual Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterStringGreaterOrEqual Properties
FilterStringGreaterOrEqual Class See Also
---
The FilterStringGreaterOrEqual type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from FilterStringRuleEvaluator.) |

# See Also
FilterStringGreaterOrEqual Class
Autodesk.Revit.DB Namespace